using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Task_2
{
    class Program
    {
        /*
         Задание 2
            Используя Visual Studio, создайте проект по шаблону Console Application.
            Требуется:
            Создать класс, представляющий учебный класс ClassRoom.
            Создайте класс ученик Pupil. В теле класса создайте методы void Study(), void Read(), void
            Write(), void Relax().
            Создайте 3 производных класса ExcelentPupil, GoodPupil, BadPupil от класса базового класса
            Pupil и переопределите каждый из методов, в зависимости от успеваемости ученика.
            Конструктор класса ClassRoom принимает аргументы типа Pupil, класс должен состоять из 4 учеников.
            Предусмотрите возможность того, что пользователь может передать 2 или 3 аргумента.
            Выведите информацию о том, как все ученики экземпляра класса ClassRoom умеют учиться, читать,
            писать, отдыхать.
        */
        static void Main(string[] args)
        {
            Pupil p1 = new BadPupil();
            Pupil p2 = new ExcelentPupil();

            ClassRoom group = new ClassRoom(p1, p2);

            group.Study();
            Console.WriteLine(new string('-', 30));
            group.Read();
            Console.WriteLine(new string('-', 30));
            group.Write();
            Console.WriteLine(new string('-', 30));
            group.Relax();

            Console.ReadKey();
        }
    }
}
